In [2]:
%matplotlib inline
import pandas as pd

In [3]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

FileNotFoundError: [Errno 2] No such file or directory: 'style-table.css'

In [59]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [19]:
titles['title'].count()

244914

### What are the earliest two films listed in the titles dataframe?

In [48]:
titles.sort_values(['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [47]:
len(titles[titles.title == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [49]:
len(titles[titles.title == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [50]:
df = titles[titles.title == 'Hamlet'].sort_values(['year']).head(1)
print(df)
print('The movie titled "Hamlet" made was first made on',df['year'])

        title  year
52521  Hamlet  1910
The movie titled "Hamlet" made was first made on 52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [60]:
titles[titles.title == 'Treasure Island'].sort_values(['year'])

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [107]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [104]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [132]:
#len (titles[titles.year >= 1950] )

len(titles[(titles.year >= 1950) & (titles.year <= 1959)])

12934

### In what years has a movie titled "Batman" been released?

In [52]:
titles[titles.title == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [66]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [72]:
df1 = cast[cast.title == 'Inception']
len(df1['character'].unique())

56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [136]:
df2 = cast[cast.title == 'Inception']
df2.isna().sum().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [176]:
df2 = cast[(cast.title == 'Inception') & (cast.n > 0)]
print(df2)
len(df2)

             title  year                  name     type  \
149008   Inception  2010          Peter Basham    actor
183937   Inception  2010          Tom Berenger    actor
260128   Inception  2010        Virgile Bramly    actor
326745   Inception  2010         Michael Caine    actor
333415   Inception  2010          Earl Cameron    actor
433867   Inception  2010         Nicolas Clerc    actor
444385   Inception  2010        Adam (IV) Cole    actor
517227   Inception  2010    Jean-Michel Dagory    actor
590576   Inception  2010     Leonardo DiCaprio    actor
709436   Inception  2010             Russ Fega    actor
737322   Inception  2010      Mark Fleischmann    actor
807795   Inception  2010        Michael Gaston    actor
812135   Inception  2010       Johnathan Geare    actor
832083   Inception  2010         Carl Gilliard    actor
833376   Inception  2010           Jack Gilroy    actor
859993   Inception  2010  Joseph Gordon-Levitt    actor
910757   Inception  2010            Lukas Haas    actor
940923   Inception  2010             Tom Hardy    actor
967176   Inception  2010          Ryan Hayward    actor
1170785  Inception  2010          Tim Kelleher    actor
1309851  Inception  2010            Tai-Li Lee    actor
1455534  Inception  2010       Tohoru Masamune    actor
1615709  Inception  2010        Cillian Murphy    actor
1618527  Inception  2010     Jack (III) Murray    actor
1668790  Inception  2010          Magnus Nolan    actor
1701902  Inception  2010          Yuji Okumoto    actor
1812091  Inception  2010        Andrew Pleavin    actor
1826027  Inception  2010    Pete Postlethwaite    actor
1861317  Inception  2010          Marc Raducci    actor
1876301  Inception  2010            Dileep Rao    actor
2049179  Inception  2010           Felix Scott    actor
2250605  Inception  2010         Jason Tendell    actor
2267383  Inception  2010        Kraig Thornber    actor
2406531  Inception  2010          Ken Watanabe    actor
2614557  Inception  2010      Natasha Beaumont  actress
2765969  Inception  2010      Marion Cotillard  actress
2776554  Inception  2010       Helena Cullinan  actress
2807441  Inception  2010      Coralie Dedykere  actress
2932657  Inception  2010          Claire Geare  actress
2932664  Inception  2010          Taylor Geare  actress
3151982  Inception  2010         Silvie Laguna  actress
3158892  Inception  2010          Shelley Lang  actress
3203564  Inception  2010     Alex (II) Lombard  actress
3225843  Inception  2010         Jill Maddrell  actress
3343512  Inception  2010      Angela Nathenson  actress
3359825  Inception  2010         Miranda Nolan  actress
3387147  Inception  2010            Ellen Page  actress
3444628  Inception  2010        Nicole Pulliam  actress
3473041  Inception  2010    Lisa (II) Reynolds  actress
3480170  Inception  2010         Talulah Riley  actress
3731263  Inception  2010        Shannon Welles  actress

                       character     n
149008     Fischer's Jet Captain  44.0
183937                  Browning   8.0
260128            Bridge Sub Con  29.0
326745                     Miles  11.0
333415          Elderly Bald Man  20.0
433867            Bridge Sub Con  26.0
444385               Bar Sub Con  34.0
517227            Bridge Sub Con  30.0
590576                      Cobb   1.0
709436                Cab Driver  23.0
737322           Penrose Sub Con  32.0
807795       Immigration Officer  45.0
812135           James (3 years)  17.0
832083             Lobby Sub Con  40.0
833376                  Old Cobb  50.0
859993                    Arthur   2.0
910757                      Nash  12.0
940923                     Eames   4.0
967176                    Lawyer  21.0
1170785                 Thin Man  24.0
1309851                  Tadashi  13.0
1455534  Japanese Security Guard  18.0
1615709           Robert Fischer   7.0
1618527              Bar Sub Con  35.0
1668790        James (20 months)  15.0
1701902        Saito's Attendant  19.0
1812091              Businessman  47.0
1826027          Maurice Fischer  10.0
1861317            Lobby Sub Con  39.0
1876301                    Yusuf   6.0
2049179              Businessman  46.0
2250605         Fischer's Driver  49.0
2267383              Bar Sub Con  36.0
2406531                    Saito   5.0
2614557              Bar Sub Con  38.0
2765969                      Mal   9.0
2776554          Penrose Sub Con  31.0
2807441           Bridge Sub Con  27.0
2932657       Phillipa (3 years)  14.0
2932664       Phillipa (5 years)  16.0
3151982           Bridge Sub Con  28.0
3158892          Penrose Sub Con  33.0
3203564            Lobby Sub Con  42.0
3225843            Lobby Sub Con  41.0
3343512              Bar Sub Con  37.0
3359825         Flight Attendant  22.0
3387147                  Ariadne   3.0
3444628            Lobby Sub Con  43.0
3473041            Private Nurse  48.0
3480170                   Blonde  25.0
3731263                  Old Mal  51.0

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [144]:
df7 = cast[(cast.title == 'North by Northwest')].sort_values(['n']).dropna()
df7

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [143]:
df6 = cast[(cast.title == 'Sleuth') & (cast.year == 1972)].sort_values(['n']).dropna()
df6

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [126]:
df5 = cast[(cast.title == 'Sleuth') & (cast.year == 2007)].sort_values(['year']).dropna()

df5

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [122]:
 cast[(cast.title == 'Hamlet') & (cast.year == 1921)]

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

### How many roles were credited in Branagh’s 1996 Hamlet?

In [121]:
df2 = cast[(cast.title == 'Hamlet') & (cast.year == 1996)]
len(df2['character'].unique())

49

### How many "Hamlet" roles have been listed in all film credits through history?

In [103]:
len(cast[cast.character == 'Hamlet'])

96

### How many people have played an "Ophelia"?

In [101]:
len(cast[cast.character == 'Ophelia'])

117

### How many people have played a role called "The Dude"?

In [81]:
len(cast[cast.character == 'The Dude'])

19

### How many people have played a role called "The Stranger"?

In [82]:
len(cast[cast.character == 'The Stranger'])

212

### How many roles has Sidney Poitier played throughout his career?

In [129]:
df3 = cast[cast.name == 'Sidney Poitier']
len(df3['character'].unique())

41

### How many roles has Judi Dench played?

In [85]:
df3 = cast[cast.name == 'Judi Dench']
len(df3['character'].unique())

46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [149]:
df2 = cast[(cast.name == 'Cary Grant') & (cast.year >= 1940) & (cast.year <= 1949) & (cast.n == 2)].sort_values(['year'])
df2

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [168]:
df2 = cast[(cast.name == 'Cary Grant') & (cast.year >= 1940) & (cast.year <= 1949) & (cast.n == 1)].sort_values(['year'])

df2

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [156]:
df4 = cast[(cast.year >= 1950) & (cast.year <= 1959) & (cast.type == 'actor')]
#print(df4)
len(df4['character'].unique())

93369

### How many roles were available for actresses in the 1950s?

In [157]:
df4 = cast[(cast.year >= 1950) & (cast.year <= 1959) & (cast.type == 'actress')]
#print(df4)
len(df4['character'].unique())

36266

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [159]:
df4 = cast[(cast.year <= 1980) & (cast.n == 1)]
len(df4['character'].unique())

52152

### How many non-leading roles were available through from the beginning of film history through 1980?

In [160]:
df4 = cast[(cast.year <= 1980) & (cast.n == 2)]
len(df4['character'].unique())

48849

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [175]:
df4 = cast[(cast.year <= 1980) ]
df4.isna().sum().sum()
#len(df4['character'].unique())

448347